In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [4]:
%%sql
DROP table if exists Student;
CREATE TABLE Student(
[Student_Name]  varchar(30),
[Total_Marks]  int ,
[Year]  int);

 * sqlite:///./test.db
Done.
Done.

[]

In [6]:
%%sql
INSERT INTO Student VALUES('Rahul',90,2010);
INSERT INTO Student VALUES('Sanjay',80,2010);
INSERT INTO Student VALUES('Mohan',70,2010);
INSERT INTO Student VALUES('Rahul',90,2011);
INSERT INTO Student VALUES('Sanjay',85,2011);
INSERT INTO Student VALUES('Mohan',65,2011);
INSERT INTO Student VALUES('Rahul',80,2012);
INSERT INTO Student VALUES('Sanjay',80,2012);
INSERT INTO Student VALUES('Mohan',90,2012);

 * sqlite:///./test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql select * from Student

 * sqlite:///./test.db
Done.

[('Rahul', 90, 2010),
 ('Sanjay', 80, 2010),
 ('Mohan', 70, 2010),
 ('Rahul', 90, 2011),
 ('Sanjay', 85, 2011),
 ('Mohan', 65, 2011),
 ('Rahul', 80, 2012),
 ('Sanjay', 80, 2012),
 ('Mohan', 90, 2012)]

SQL to Display Student name,total marks, year and previous year marks only for those Students whose
total marks are greater than/equal to prev year marks

In [13]:
%%sql
select * from (
select Student_Name,total_marks,year,lead(total_marks,1) 
over (partition by Student_Name order by year desc) prev_year_marks from Student)x
where total_marks >= prev_year_marks

 * sqlite:///./test.db
Done.

[('Mohan', 90, 2012, 65), ('Rahul', 90, 2011, 90), ('Sanjay', 85, 2011, 80)]